CSI API ETABS v1

# cDCoACI318_14SetOverwrite Method

---

Sets the value of a concrete design overwrite item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOverwrite(
    	string Name,
    	int Item,
    	double Value,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetOverwrite (
    	Name As String,
    	Item As Integer,
    	Value As Double,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cDCoACI318_14
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetOverwrite(Name,
    	Item, Value, ItemType)

    int SetOverwrite(
    	String^ Name,
    	int Item,
    	double Value,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetOverwrite :
            Name : string *
            Item : int *
            Value : float *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing frame object or group, depending on the value of the
ItemType

Item

    Type: SystemInt32
This is an integer between 1 and 13, inclusive, indicating the overwrite item
considered.

  1. Framing type
  2. Live load reduction factor
  3. Unbraced length ratio, Major
  4. Unbraced length ratio, Minor
  5. Effective length factor, K Major
  6. Effective length factor, K Minor
  7. Moment coefficient, Cm Major
  8. Moment coefficient, Cm Minor
  9. Nonsway moment factor, Db Major
  10. Nonsway moment factor, Db Minor
  11. Sway moment factor, Ds Major
  12. Sway moment factor, Ds Minor
  13. Consider Minimum Eccentricity

Value

    Type: SystemDouble
The value of the considered overwrite item.

  1. Framing type
     * 0 = Program Default
     * 1 = Sway special
     * 2 = Sway Intermediate
     * 3 = Sway Ordinary
     * 4 = Non-sway
  2. Live load reduction factor

Value >= 0; 0 means use program determined value

  3. Unbraced length ratio, Major

Value >= 0; 0 means use program determined value

  4. Unbraced length ratio, Minor

Value >= 0; 0 means use program determined value

  5. Effective length factor, K Major

Value >= 0; 0 means use program determined value

  6. Effective length factor, K Minor

Value >= 0; 0 means use program determined value

  7. Moment coefficient, Cm Major

Value >= 0; 0 means use program determined value

  8. Moment coefficient, Cm Minor

Value >= 0; 0 means use program determined value

  9. Nonsway moment factor, Db Major

Value >= 0; 0 means use program determined value

  10. Nonsway moment factor, Db Minor

Value >= 0; 0 means use program determined value

  11. Sway moment factor, Ds Major

Value >= 0; 0 means use program determined value

  12. Sway moment factor, Ds Minor

Value >= 0; 0 means use program determined value

  13. Consider Minimum Eccentricity

0 = No

Any other value = Yes

ItemType (Optional)

    Type: ETABSv1eItemType
This is one of the following items in the
eItemType enumeration:

  * Object = 0
  * Group = 1
  * SelectedObjects = 2

If this item is Objects, the
overwrite is set for the frame object specified by the Name item.

If this item is Group, the
overwrite is set for all frame objects in the group specified by the Name
item.

If this item is SelectedObjects,
the overwrite is set for all selected frame objects and the Name item is
ignored.

#### Return Value

Type: Int32
Returns zero if the item is successfully set; otherwise it returns a nonzero
value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("ACI 318-14")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'set overwrite item
       ret = SapModel.DesignConcrete.ACI318_14.SetOverwrite("8", 1, 1)

    'get overwrite item
       ret = SapModel.DesignConcrete.ACI318_14.GetOverwrite("8", 1, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoACI318_14 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com